mcp-parallel/findings/gateway-pipeline-bench-2026-08-14/ab_health_c400.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        uvicorn
Server Hostname:        127.0.0.1
Server Port:            8300

Document Path:          /health
Document Length:        354 bytes

Concurrency Level:      400
Time taken for tests:   13.069 seconds
Complete requests:      120000
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      61320000 bytes
HTML transferred:       42480000 bytes
Requests per second:    9181.82 [#/sec] (mean)
Time per request:       43.564 [ms] (mean)
Time per request:       0.109 [ms] (mean, across all concurrent requests)
Transfer rate:          4581.95 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.9      0      17
Processing:     3   43  31.8     38     523
Waiting:        1   33  27.4     28     498
Total:          4   43  31.8     38     528

Percentage of the requests served within a certain time (ms)
  50%     38
  66%     40
  75%     41
  80%     42
  90%     48
  95%     58
  98%    204
  99%    227
 100%    528 (longest request)